#### IntegerRange Members

---

|  |
| --- |
| IntegerRange Class   Methods   Properties   See Also |

The  IntegerRange  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  IntegerRange |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | High | The upper limit of the range |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | Low | The lower limit of the range |

# See Also

IntegerRange Class

Autodesk.Revit.DB Namespace